#include <iostream>
#include <vector>

using namespace std;

// Функция сортировки вставками
void insertionSort(vector<int>& arr) {
    int n = arr.size();  // Получаем размер массива

    // Внешний цикл: проходим по элементам массива, начиная со второго (индекс 1)
    for (int i = 1; i < n; i++) {
        int key = arr[i];  // Текущий элемент, который нужно вставить в отсортированную часть
        int j = i - 1;  // Индекс предыдущего элемента в отсортированной части

        // Внутренний цикл: сдвигаем элементы отсортированной части вправо, пока не найдем место для key
        while (j >= 0 && arr[j] > key) {
            arr[j + 1] = arr[j];  // Сдвигаем элемент вправо
            j = j - 1;  // Переходим к предыдущему элементу в отсортированной части
        }

        // Вставляем key на правильное место (после сдвига элементов)
        arr[j + 1] = key;
    }
}

int main() {
    vector<int> arr = { 12, 11, 13, 5, 6 };
    int n = arr.size();

    cout << "Исходный массив: ";
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    insertionSort(arr);

    cout << "Отсортированный массив: ";
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;

    return 0;
}